%Массив с выгруженными данными о тепловом потоке (для одного числа прандтля) 
Q = [0.1	147.235
0.0989491	146.703
0.0977407	145.814
0.0963509	145.387
0.0947527	145.339
0.0929148	145.637
0.0908011	146.222
0.0883704	147.09
0.0855751	148.245
0.0823606	149.71
0.0786638	151.522
0.0744125	153.741
0.0695235	156.46
0.0639012	159.853
0.0574355	164.278
0.05	170.362
0.0425645	177.846
0.0360988	185.885
0.0304765	194.572
0.0255875	204.057
0.0213362	214.524
0.0176394	226.252
0.0144249	239.665
0.0116296	255.339
0.00919889	274.04
0.00708525	297.443
0.0052473	329.532
0.00364909	381.545
0.00225933	488.375
0.00105085	744.152
0	908.582];


%Параметры среды
lambda = 0.0259;
T = 40;
Pr = 0.07;
betta = 1/20;


%Считаем числа Нуссельта и всё для их вычислений 
H = 0.75*(2*Pr/(5*(1+2*sqrt(Pr)+2*Pr)))^0.25;

Nu_y = [];
Nu_auto = [];
Nu_emp = [];
sum = 0;

for i = 1:length(Q)
   Nu_y(i) = Q(i,1).*Q(i,2)./(lambda*T);
   sum = sum + Nu_y(i);
   
   Ra_y = (Pr * 9.81 * betta * T * Q(i,1).^3) / (1.8*10^(-5))^2 ;
   Nu_auto(i) = H * Ra_y^0.25;
   Nu_emp(i) = 0.6 * (1 + (1 + 1/sqrt(Pr))^2)^(-0.25) * Ra_y^0.25;
    
end

%Вывод графика
figure
plt = plot(Nu_y, Q(:,1), 'g', Nu_auto, Q(:,1), 'm', Nu_emp, Q(:,1), 'k')
plt(1).LineWidth = 1;
plt(2).LineWidth = 1;
plt(3).LineWidth = 1;
xl = xlabel('Nu');
xl.FontSize = 14;
yl = ylabel('Position, [m]');
yl.FontSize = 14;

lgd = legend('Nu_y', 'Nu_{auto}', 'Nu_{empir}', 'Location', 'southeast');
lgd.FontSize = 14;













